app/Models/TeacherModel.php

SELECT `branch_id`, `branch_name`
FROM `db_kinder_branch`
WHERE `branch_role` = '1'
AND `branch_status` = '1'
---
    public function getBranches()
    {
        return $this->db->table('db_kinder_branch')
            ->select('branch_id, branch_name')
            ->where('branch_role', '1') // Only admin branches
            ->where('branch_status', '1')
            ->get()
            ->getResultArray();

SELECT `kdgn_id`, `kindergarden_name`
FROM `db_kindergarden`
WHERE `kindergarden_status` = '1'
---
    public function getKindergarden()
    {
        return $this->db->table('db_kindergarden')
            ->select('kdgn_id, kindergarden_name')
            ->where('kindergarden_status', '1')
            ->get()
            ->getResultArray();