app/Models/TeacherModel.php

SELECT COUNT(*) AS `numrows`
FROM `db_teacher` `t`
LEFT JOIN `db_kinder_branch` `br` ON `br`.`branch_id` = `t`.`branch_id`
LEFT JOIN `db_kindergarden` `k` ON `k`.`kdgn_id` = `t`.`kdgn_id`
LEFT JOIN `db_kinder_management` `m` ON `m`.`kdmgm_id` = `t`.`kdmgm_id`
SELECT `t`.*, `br`.`branch_name`, `k`.`kindergarden_name`, `m`.`mgm_full_name` as `manager_name`
FROM `db_teacher` `t`
LEFT JOIN `db_kinder_branch` `br` ON `br`.`branch_id` = `t`.`branch_id`
LEFT JOIN `db_kindergarden` `k` ON `k`.`kdgn_id` = `t`.`kdgn_id`
LEFT JOIN `db_kinder_management` `m` ON `m`.`kdmgm_id` = `t`.`kdmgm_id`
ORDER BY `t`.`teacher_id` DESC
 LIMIT 20
---
        $totalRecord = $totalBuilder->countAllResults();

        // Get paginated data
        $data = $builder->orderBy('t.teacher_id', 'DESC')
                       ->limit($params['rowperpage'], $offset)
                       ->get()
                       ->getResultArray();

SELECT `t`.*, `b`.`branch_username`, `b`.`branch_childcare`, `b`.`branch_status` as `login_status`, `br`.`branch_name`, `k`.`kindergarden_name`, `m`.`mgm_full_name` as `manager_name`
FROM `db_teacher` `t`
LEFT JOIN `db_kinder_branch` `b` ON `b`.`teacher_ref_id` = `t`.`teacher_id`
LEFT JOIN `db_kinder_branch` `br` ON `br`.`branch_id` = `t`.`branch_id`
LEFT JOIN `db_kindergarden` `k` ON `k`.`kdgn_id` = `t`.`kdgn_id`
LEFT JOIN `db_kinder_management` `m` ON `m`.`kdmgm_id` = `t`.`kdmgm_id`
WHERE `t`.`teacher_id` = '2'
---
    public function getTeacherDetails($teacherId)
    {
        $builder = $this->db->table($this->table . ' t');
        $teacher = $builder->select('t.*,
                                   b.branch_username,
                                   b.branch_childcare,
                                   b.branch_status as login_status,
                                   br.branch_name,
                                   k.kindergarden_name,
                                   m.mgm_full_name as manager_name')
                          ->join('db_kinder_branch b', 'b.teacher_ref_id = t.teacher_id', 'left')
                          ->join('db_kinder_branch br', 'br.branch_id = t.branch_id', 'left')
                          ->join('db_kindergarden k', 'k.kdgn_id = t.kdgn_id', 'left')
                          ->join('db_kinder_management m', 'm.kdmgm_id = t.kdmgm_id', 'left')
                          ->where('t.teacher_id', $teacherId)
                          ->get()
                          ->getRowArray();

UPDATE `db_teacher` SET `teacher_name` = 'Justin', `age` = '31', `highest_qualification` = 'Secondary education', `kap_certificate` = '2', `hired_date` = '2025-07-20', `id_number` = '029383871212', `phone_number` = '0123456789', `address` = 'asdasdasdasd', `status` = '1', `modified_date` = '2025-07-23 17:30:14'
WHERE `db_teacher`.`teacher_id` IN ('2')
---
    public function updateTeacherWithAccount($teacherId, $teacherData, $loginData = null)
    {
        $this->db->transStart();

        try {
            // Update teacher
            $this->update($teacherId, $teacherData);

SELECT COUNT(*) AS `numrows`
FROM `db_teacher`
WHERE `id_number` = '029383871212'
AND `teacher_id` != '2'
---
    public function isIdNumberExists($idNumber, $excludeTeacherId = null)
    {
        $builder = $this->db->table($this->table);
        $builder->where('id_number', $idNumber);

        if ($excludeTeacherId) {
            $builder->where('teacher_id !=', $excludeTeacherId);
        }

        return $builder->countAllResults() > 0;

SELECT `branch_id`, `branch_name`
FROM `db_kinder_branch`
WHERE `branch_role` = '1'
---
    public function getBranches()
    {
        return $this->db->table('db_kinder_branch')
                       ->select('branch_id, branch_name')
                       ->where('branch_role', '1') // Only admin branches
                       ->get()
                       ->getResultArray();

SELECT `kdgn_id`, `kindergarden_name`
FROM `db_kindergarden`
WHERE `kindergarden_status` = '1'
---
    public function getKindergarden()
    {
        return $this->db->table('db_kindergarden')
                       ->select('kdgn_id, kindergarden_name')
                       ->where('kindergarden_status', '1')
                       ->get()
                       ->getResultArray();