app/Models/TeacherModel.php

SELECT COUNT(*) AS `numrows`
FROM `db_teacher` `t`
LEFT JOIN `db_kinder_branch` `br` ON `br`.`branch_id` = `t`.`branch_id`
LEFT JOIN `db_kindergarden` `k` ON `k`.`kdgn_id` = `t`.`kdgn_id`
LEFT JOIN `db_kinder_management` `m` ON `m`.`kdmgm_id` = `t`.`kdmgm_id`
SELECT `t`.*, `br`.`branch_name`, `k`.`kindergarden_name`, `m`.`mgm_full_name` as `manager_name`
FROM `db_teacher` `t`
LEFT JOIN `db_kinder_branch` `br` ON `br`.`branch_id` = `t`.`branch_id`
LEFT JOIN `db_kindergarden` `k` ON `k`.`kdgn_id` = `t`.`kdgn_id`
LEFT JOIN `db_kinder_management` `m` ON `m`.`kdmgm_id` = `t`.`kdmgm_id`
ORDER BY `t`.`teacher_id` DESC
 LIMIT 20
---
            $totalRecord = $countBuilder->countAllResults(false);

            // Apply pagination
            $query = $builder->orderBy('t.teacher_id', 'DESC')
                           ->limit($where['rowperpage'], $indexing)
                           ->get()
                           ->getResultArray();

SELECT `t`.*, `b`.`branch_username`, `b`.`branch_childcare`, `b`.`branch_status` as `login_status`, `br`.`branch_name`, `k`.`kindergarden_name`, `m`.`mgm_full_name` as `manager_name`
FROM `db_teacher` `t`
LEFT JOIN `db_kinder_branch` `b` ON `b`.`teacher_ref_id` = `t`.`teacher_id`
LEFT JOIN `db_kinder_branch` `br` ON `br`.`branch_id` = `t`.`branch_id`
LEFT JOIN `db_kindergarden` `k` ON `k`.`kdgn_id` = `t`.`kdgn_id`
LEFT JOIN `db_kinder_management` `m` ON `m`.`kdmgm_id` = `t`.`kdmgm_id`
WHERE `t`.`teacher_id` = 2
---
    public function selectTeacherDetails($where)
    {
        try {
            $builder = $this->db->table($this->table . ' t');
            $query = $builder->select('t.*,
                                     b.branch_username,
                                     b.branch_childcare,
                                     b.branch_status as login_status,
                                     br.branch_name,
                                     k.kindergarden_name,
                                     m.mgm_full_name as manager_name')
                            ->join('db_kinder_branch b', 'b.teacher_ref_id = t.teacher_id', 'left')
                            ->join('db_kinder_branch br', 'br.branch_id = t.branch_id', 'left')
                            ->join('db_kindergarden k', 'k.kdgn_id = t.kdgn_id', 'left')
                            ->join('db_kinder_management m', 'm.kdmgm_id = t.kdmgm_id', 'left')
                            ->where('t.teacher_id', $where['teacher_id'])
                            ->get()->getRowArray();

SELECT `branch_id`, `branch_name`
FROM `db_kinder_branch`
WHERE `branch_role` = '1'
AND `branch_status` = '1'
---
    public function selectBranches()
    {
        try {
            $builder = $this->db->table('db_kinder_branch');
            $query = $builder->select('branch_id, branch_name')
                           ->where('branch_role', '1') // Only admin branches
                           ->where('branch_status', '1')
                           ->get()->getResultArray();

SELECT `kdgn_id`, `kindergarden_name`
FROM `db_kindergarden`
WHERE `kindergarden_status` = '1'
---
    public function selectKindergartens()
    {
        try {
            $builder = $this->db->table('db_kindergarden');
            $query = $builder->select('kdgn_id, kindergarden_name')
                           ->where('kindergarden_status', '1')
                           ->get()->getResultArray();